week6/day3/gossip_rails_c/app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    @gossip = Gossip.all