week6/day3/gossip_rails_c/app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips" ORDER BY "gossips"."updated_at" DESC
---
  def index
    @gossips = Gossip.all.order(updated_at: :desc)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
  def show
    @gossip = Gossip.find_by(:id => params[:id])

SELECT "users".* FROM "users"
---
  def new
    @gossip = Gossip.new
    @user_id  = User.all.sample.id

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "TestThibe"], ["content", "dfgsdfg"], ["user_id", 5], ["created_at", "2020-08-05 14:29:50.963100"], ["updated_at", "2020-08-05 14:29:50.963100"]]
---
  def create
    @gossip = Gossip.new(gossip_params)
    if @gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def edit
    @gossip = Gossip.find(params[:id])
    @user_id = User.all.sample.id

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "user_id" = $3, "updated_at" = $4 WHERE "gossips"."id" = $5  [["title", "MustWork"], ["content", "This must be work!"], ["user_id", 2], ["updated_at", "2020-08-05 13:35:36.050218"], ["id", 33]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
  def update
    @gossip = Gossip.find(params[:id])
    if @gossip.update(gossip_params)
      flash[:success] = "Update Gossip Success!"
      redirect_to gossips_path
    else
      @gossip.errors.full_messages.each do |message|

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
    def gossip_filter
      @gossip = Gossip.find_by(:id => params[:id]) or not_found