week6/day3/gossip_rails_c/app/controllers/static_pages_controller.rb

SELECT "gossips".* FROM "gossips" ORDER BY "gossips"."updated_at" DESC
SELECT "gossips".* FROM "gossips"
---
  def home
    @first_name = params[:first_name]
    @gossips = Gossip.all.order(updated_at: :desc)
    @lastest_gossips = @gossips.take(16)