week6/day3/gossip_rails_c/app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
  def index
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find_by(:id => params[:id])

SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "Alene"], ["LIMIT", 1]]
---
  def show_by_first_name
    @user = User.find_by(:first_name => params[:first_name])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def user_filter
      @user = User.find_by(:id => params[:id]) or not_found