week6/day3/gossip_rails_c/app/views/static_pages/home.html.erb

                                      <a href="<%= user_path(gossip.user.id)%>" >
                                        <i class="fas fa-user"></i> <span><%= gossip.user.first_name %></span>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]