week6/day1/gossip_rails_a/app/views/gossip/gossip.html.erb

        <div class="card-header">
          <%= link_to "Auteur: " + @gossip.user.first_name , profile_path(:first_name => @gossip.user.first_name)%></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]