week6/day2/gossip_rails_b/app/views/gossip/gossip.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
        <div class="card-header">
          <%= link_to "Auteur: " + @gossip.user.first_name , profile_path(:first_name => @gossip.user.first_name)%></p>