week6/day3/gossip_rails_c/app/views/gossips/_gossips_list.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
                <div class=" pt-1" style="positon: relative">
                  <%= link_to gossip.user.first_name, user_path(:id => gossip.user.id), :class =>'h5'%>