week6/day3/gossip_rails_c/app/views/gossips/index.html.erb

SELECT "gossips".* FROM "gossips" ORDER BY "gossips"."updated_at" DESC
---
      <div class="row mb-3">
      <% Gossip.all.each do |gossip|%>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
                <div class=" pt-1" style="positon: relative">
                  <%= link_to gossip.user.first_name, user_path(:id => gossip.user.id), :class =>'h5'%>