week6/day3/gossip_rails_c/app/views/gossips/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
        <p class="lead">by
          <a href="#"><%= @gossip.user.first_name%> <%= @gossip.user.last_name %></a>