week6/day1/gossip_rails_a/app/controllers/gossip_controller.rb

  def gossip
    id = params[:id]
    @gossip = Gossip.find_by(:id => id)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]