week6/day1/gossip_rails_a/app/controllers/profile_controller.rb

  def profile
    @user = User.find_by(:first_name => params[:first_name])
---
SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "Lakendra"], ["LIMIT", 1]]