week6/day1/gossip_rails_a/app/views/welcome/show.html.erb

SELECT "gossips".* FROM "gossips"
---
        <div class="row mb-3">
      <% Gossip.all.each do |gossip|%>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
                  <a class="h5"
                    href="/profile/<%= gossip.user.first_name %>/"><b><%= gossip.user.first_name %></b></a><br>