week6/day2/gossip_rails_b/app/views/profile/profile.html.erb

    <h3 class="mt-4 mb-4">List of gossips of <%= @user.first_name %></h3>
    <% @user.gossips.each do |gossip|%>
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = $1  [["user_id", 3]]