week6/day2/gossip_rails_b/app/views/static_pages/home.html.erb

      <div class="row mb-3">
      <% Gossip.all.each do |gossip|%>
---
SELECT "gossips".* FROM "gossips"

                <div class=" pt-1" style="positon: relative">
                  <%= link_to gossip.user.first_name, user_path(:id => gossip.user.id), :class =>'h5'%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]