week6/day2/gossip_rails_b/app/controllers/gossips_controller.rb

    def gossip_filter
      @gossip = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]