week6/day2/gossip_rails_b/app/controllers/gossips_controller.rb

  def index
    @gossip = Gossip.all
---
SELECT "gossips".* FROM "gossips"

  def show
    @gossip = Gossip.find_by(:id => params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]

  def create
    @gossip = Gossip.new(title: gossip_params[:title], content: gossip_params[:content], user: User.all.sample)
    if @gossip.save
---
SELECT "users".* FROM "users"
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Test something "], ["content", "Hi everyone!"], ["user_id", 5], ["created_at", "2020-08-04 23:02:40.870461"], ["updated_at", "2020-08-04 23:02:40.870461"]]