week6/day2/gossip_rails_b/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if params[:query].present?
      @query = params[:query]
      @users = User.where("name iLike '%#{params[:query]}%'")
    else
      @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def show
    @user = User.find_by(:id => params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def user_filter
      @user = User.find(params[:id])