week6/day2/gossip_rails_b/app/views/gossips/_form.html.erb

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  </div>
  <%= hidden_field_tag "gossip[user_id]", User.all.sample.id %>