week6/day2/gossip_rails_b/app/views/gossips/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
        <div class="card-header">
          <%= link_to "Author: " + @gossip.user.first_name , user_path(:first_name => @gossip.user.first_name)%></p>